tap "ahmetb/kubectx"
brew "git"
brew "zsh"
brew "neovim"
brew "tmux"
brew "htop"
brew "curl"
brew "wget"
brew "jq"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "starship"
brew "docker"
brew "podman"
brew "python"
brew "node"
