cask_args appdir: "/Applications"

# Essentials
cask "warp"
cask "wezterm"
cask "rectangle"
cask "iterm2" # Optional fallback
brew "git"
brew "neovim"
brew "zsh"
brew "tmux"
brew "htop"
brew "tree"
brew "bat"
brew "fzf"

# Terminal Dev Tools
brew "lazydocker"
brew "ctop"
brew "dive"
brew "hadolint"
brew "docker-slim"

# Kubernetes CLI Tools
brew "k9s"
brew "kubectx"
brew "kubens"
brew "helm"
brew "stern"

# Git Tools
brew "lazygit"
brew "delta"
brew "gh"
brew "ghq"
brew "tig"

# Dev Utils
brew "curl"
brew "wget"
brew "openssl"
brew "coreutils"
brew "findutils"
brew "moreutils"
brew "grep"
brew "jq"
brew "yq"
brew "unzip"
brew "p7zip"
brew "httpie"
brew "fd"
brew "ripgrep"
brew "exa"
brew "zoxide"
brew "bottom"

# Runtimes via asdf (use only if needed)
brew "pyenv"
brew "rbenv"
brew "nvm"
brew "cmake"
brew "maven"
brew "gradle"
brew "openjdk"

# Container stack
brew "colima"
brew "docker"
brew "podman"

# AI
brew "ollama"
